Revit 2027 API
RebarPresentationMode Enumeration
 Bar presentation mode
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RebarPresentationMode
Public Enumeration RebarPresentationMode
public enum class RebarPresentationMode
type RebarPresentationMode
Members
Member name | Value | Description
All | 0 |  All bars are presented.
FirstLast | 1 |  The first and last bars are presented.
Middle | 2 |  The middle bar is presented.
Select | 3 |  Selected bars are presented.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace